<?php
//raply_random.phpで特定の単語を受け取った場合に特定の反応を返したいときに使う、反応のパターンを書くためのファイルです。
//複数のパターンに一致する場合は上のものが優先されます。PHPの正規表現にも対応しています。

$reply_pattern = array(
    //「おはよ」を含む発言（「おはよ」「おはよう」「おはよー」など）を受け取ると「おはようございます、御主人様」もしくは「Good Morning, Master.」と返すサンプルです
    "おはよ"=> array(
        "おはようございます、御主人様",
        "Good morning, master.",
    ),
    //「今日の運勢」を含む発言を受け取ると６種(?)類の中からランダムな返答を返すサンプルです
    "(お|御)?(みくじ|御籤|神籤|運勢|运势)"=> array(
        "大吉，大吉就是大吉，有什么了不起的……",
        "中吉，一切顺利一切顺利，嗯！",
        "小吉，一定会有好事发生的吧w",
        "末吉，听上去不太好，不过其实比吉要好哦。",
        "吉，没什么，就是吉而已。",
        "凶，没什么大不了的，不就凶嘛。",
        "末凶，这感觉一定不太好，主要是呼吸…",
        "小胸，要相信稀少价值，还会发展的！",
        "中凶，没事没事，一切看上去都很平常。",
        "大凶，其实应该偷着乐了吧，这个……",
    ),
    // お賽銭?
    "(お|御)?(さいせん|賽銭)"=> array(
    	"人家这里又不是神社……{id}不要这样啦///",
    	"虽然没这项服务，不过既然你一番好意，那就有多少收多少吧-_,-",
    	"这么有米不如去买点金坷垃吧，找@kinkora_bot！（我什么都不知道",
    ),
    // TARO牌
    "(抽牌|塔罗|(?i)TARRO)"=> array(
    	"其实我也最近才学会TARRO占卜的哦……看看{name}{year}年{month}月{day}日的运气怎么样。那么，再回复我一次就要开始了哦~~~~~~",
		"{name}{year}年{month}月{day}日翻到【0.愚者】【正位】流浪与众不同、幸运、不拘一格、追求新奇的梦想、眼界狭小、勇于冒险、向往自由、有艺术家气质、直攻要害、情感起伏不定、自由恋爱。嘛……一般吧……总体来说，有点神经质。是呢",
		"{name}{year}年{month}月{day}日翻到【I.魔术师】【正位】创造成功、果断、好的开端、计划完美、发展空间大、智力非凡、思维活跃、想象力丰富、拥有默契的伴侣、出现新恋人。看起来不错哦如果之前有恋人，那个“出现新恋人”也是吗……这个……",
		"{name}{year}年{month}月{day}日翻到【Ⅱ.女祭司】【正位】智能知性、优秀的判断力和洞察力、独立自主、有知己、善于交流、意志坚强、擅长精神方面的研究、柏拉图式的恋爱、冷淡的恋情。看来是个事业大于爱情的人。是呢。",
		"{name}{year}年{month}月{day}日翻到【Ⅲ.皇后】【正位】智能繁荣、感情丰富、信仰坚定、心胸开阔、生活优雅、财运佳、公众人物、有魅力的女性、充实的爱、有结果的恋情、怀孕。如果是男人抽到这张也是“怀孕”吗？那个……科技在发展嘛……和那个没关系！！！",
		"{name}{year}年{month}月{day}日翻到【Ⅳ.皇帝】【正位】领导坚强的意志、成绩突出、果断、节制、有领袖风范、值得信赖、物质条件优越、与伴侣年龄悬殊、嫁妆丰厚。很强势的一张牌啊！大男人主义、自信心过强、遇事不和别人商量、忠言逆耳……原本的话里没有这些,是你自己编的吧……被发现了吗?",
		"{name}{year}年{month}月{day}日翻到【V.祭司】【正位】援助温柔、博爱、受人信赖、受重视、工作出色、贡献突出、眼界狭窄、从善如流而得到好处、有贵人相助、适宜接触宗教、与年长的异性有缘、姻缘佳。总体来说是张好牌啊，加油吧“与年长的异性”……不要总是注意奇怪的地方！！！",
		"{name}{year}年{month}月{day}日翻到【Ⅵ.恋人】【正位】结合敏感、前途光明、有志同道合的朋友、与人合作、对未来的抉择、决定未来命运的时机、浪漫的爱情、有爱情出现的预感。不愧是与恋爱有关的牌啊。你恋爱了吗？触景生情？不要乱猜……",
		"{name}{year}年{month}月{day}日翻到【Ⅶ.战车】【正位】胜利活泼、有野心、握有指挥权、出发、前进必胜、速战速决、战果辉煌、开拓精神、击败对手、恋爱的胜利者、热烈的爱情。火药味好浓的一张牌啊战争，是不可避免的哦~~~~~~别用一脸高兴的表情说这些话啊……",
		"{name}{year}年{month}月{day}日翻到【Ⅷ.力量】【正位】意志不屈不挠、全力以赴、克服难关、坚强的信念、旺盛的斗志、刻苦的努力、超凡的勇气、神秘的力量、轰轰烈烈的能够经受考验的牢固爱情。可以吐槽吗??你那是什么表情啊…………你说这个?不要再来一次……",
		"{name}{year}年{month}月{day}日翻到【Ⅸ.隐者】【正位】探索高度智能、思虑缜密、冷静寡言、追求高层次的事物、正中要害、渐入佳境、出局、追求柏拉图式恋情、单相思。貌似很符合“隐者”的形象啊。",
		"{name}{year}年{month}月{day}日翻到【X.命运之轮】【正位】轮回幸运、好时机到来、非富即贵、善于随机应变、有望升职、命中注定的相逢、一见钟情、婚姻幸福。都是正面信息呢。上上签哦~~~",
		"{name}{year}年{month}月{day}日翻到【XI.正义】【正位】均衡公正、中立、诚实、心胸坦荡、表里如一、身兼两职、追求合理化、协调者、与法律有关、光明正大的交往、感情和睦。总的来说是张好人卡这句话会造成岐意的……",
		"{name}{year}年{month}月{day}日翻到【XⅡ.倒吊男】【正位】牺牲接受考验、行动受限、牺牲、不畏艰辛、不受利诱、有失必有得、汲取教训、浴火重生、广泛学习、奉献的爱。真是意外啊，大多数人都以为倒吊男是个类似小丑的角色呢。谎言就是这样汇集而成的哦~~~和“谎言”没关系吧。",
		"{name}{year}年{month}月{day}日翻到【XⅢ死神】【正位】结束失败、接近毁灭、生病、失业、维持停滞状态、持续的损害、交易停止、枯燥的生活、离别、重新开始、双方有很深的鸿沟、恋情终止。好可怕呢~~~看你一脸幸灾乐祸的样子……",
		"{name}{year}年{month}月{day}日翻到【XⅣ.节制】【正位】净化单纯、调整、平顺、互惠互利、好感转为爱意、纯爱、深爱。完了?完了好间单的牌…………",
		"{name}{year}年{month}月{day}日翻到【XV.恶魔】【正位】诱惑被束缚、堕落、生病、恶意、屈服、欲望的俘虏、不可抗拒的诱惑、颓废的生活、举债度日、不可告人的秘密、私密恋情。{name}……你是在诱惑{name}吗？",
		"{name}{year}年{month}月{day}日翻到【XⅥ.塔】【正位】破灭意外的灾难、危险、失败、名誉损坏、灾害、意外、发生疾病等意想不到之事、骄傲、自大、情况急转直下、失去一切。在TARRO牌里，这张的形象是一座被雷电击毁的高塔啊。真是张带来厄运的牌呢。",
		"{name}{year}年{month}月{day}日翻到【XⅦ.星星】【正位】希望前途光明、充满希望、想像力、创造力、幻想、满足愿望、水准提高、理想的对象、美好的恋情。抽到这张牌就表示前途一片光明了吗？只是今天而已,也有可能会在明天遭遇车祸哦。……...",
		"{name}{year}年{month}月{day}日翻到【XⅧ.月亮】【正位】不安不安、迷惑、动摇、谎言、欺骗、鬼迷心窍、动荡的爱、三角关系。不安？为什么？晚上看到月亮等于看到狼人,看到狼人等于要被吃掉,一想到被吃掉,自然会做恶梦吧~~~~~~不要乱说!!!",
		"{name}{year}年{month}月{day}日翻到【XⅨ.太阳】【正位】生命活耀、丰富的生命力、充满生机、精力充沛、工作顺利、贵人相助、幸福的婚姻、健康的交际。怪不得有个形容人的说法是“很阳光”呢。“太靠近太阳，会被融化”，飞蛾扑火说的就是这个吧。为什么会变成这样沉重的话题啊……",
		"{name}{year}年{month}月{day}日翻到【XX.审判】【正位】复活复活的喜悦、康复、坦白、好消息、好运气、初露锋芒、复苏的爱、重逢、爱的奇迹。w“审判”怎么会和“复活”连系在一起啊？是误判吧……司法的问题吗……",
		"{name}{year}年{month}月{day}日翻到【世界】【正位】达成完成、成功、完美无缺、连续不断、精神亢奋、拥有毕生奋斗的目标、完成使命、幸运降临、快乐的结束、模范情侣。完美主义的最爱啊。",
		"{name}{year}年{month}月{day}日翻到【0.愚者】【逆位】流浪自负、固执、不安定、墨守成规、缺乏责任心、生活在梦幻中、不现实、不会应变、停滞不前、行为古怪、方向错误、感情不稳定。还以为愚者倒过来会变聪明呢把128M的内存倒过来插会变成821M的哦~~~~~~胡说八道!!!",
		"{name}{year}年{month}月{day}日翻到【Ⅰ.魔术师】【逆位】创造失败、态度消极、做事匆忙、优柔寡断、才能平庸、缺乏技术、没有判断力、没有创造力、爱情没有进展、注意伴侣的行为。“注意伴侣的行为”...吗……ww{name}需要橘花帮忙吗？{name}不要把她的话当真。",
		"{name}{year}年{month}月{day}日翻到【Ⅱ.女祭司】【逆位】智能无知、冲动、缺乏理解力、神经质、有洁癖、对人冷淡、自我封闭、与女性朋友争执、单相思、健康不佳、晚婚或单身主义、不孕。看牌面是个以自我中心的人哦。不要完全相信这些啊。那你为什么还要待在这啊？我是被迫的……",
		"{name}{year}年{month}月{day}日翻到【Ⅲ.皇后】【逆位】丰富平庸、任性、迷惑、内心动摇、不知进取、自负、傲慢、疲倦、浪费、虚荣心强、计划搁置、不良的男女关系、不孕、流产。简直是一蹋糊涂啊……w",
		"{name}{year}年{month}月{day}日翻到【Ⅳ.皇帝】【逆位】领导意志薄弱、幼稚、武断、固执、傲慢、疲劳过度、经济基础薄弱、爱情很勉强、痛苦而没结果的恋情。同样是领导，正位的皇帝引导大家走向胜利、逆位的皇帝引导大家走向毁灭呢。大家不要跟错人了哦~~~~~~放心吧，绝对不会跟着你的。呜……...",
		"{name}{year}年{month}月{day}日翻到【Ⅴ.祭司】【逆位】援助冷漠、善于表达、啰哩吧嗦、孤立无援、成功无望、眼界开阔、思路敏捷、改变以往感情上的不足、不被认同的恋情、对伴侣关心过渡、姻缘淡。好人当过头了就遭人厌恶了吗……适当做点坏事吧~~~~~~不是这个意思！！！",
		"{name}{year}年{month}月{day}日翻到【Ⅵ.恋人】【逆位】结合幼稚、退休、孤独、有阻力、眼花撩乱、血气方刚、对结果失望、充满戒心、逃避爱情、恋情短暂、分手、多情。果然逆位的恋人会分手啊。也不一定哦~~~？双双殉情？没有这个选项！！！",
		"{name}{year}年{month}月{day}日翻到【Ⅶ.战车】【逆位】胜利怯懦、有强敌、受挫折、丧失斗志、急性子导致失败、缺少资金、不感兴趣、被拒绝、使对方失去信任、对爱情采取逃避态度。关键词是“胜利”哦，看起来不错啊。是逆位啊…………那就是失败了。好可怜啊。",
		"{name}{year}年{month}月{day}日翻到【Ⅷ.力量】【逆位】意志疑心过度、犹豫不决、缺乏实力、没有耐心、危险的赌注、失去自信、失去别人的信任、故弄玄虚、自大、蛮干、禁不住诱惑、爱情无法持久。正位的“力量”代表坚强的意志，那逆位……当然是薄弱的意志了。果然是一体两面啊……",
		"{name}{year}年{month}月{day}日翻到【Ⅸ.隐者】【逆位】探索工作狂、铁面无私、偏见、有怨言、不够通融、孤独、固执、戒备心强、迷失方向、举止轻浮、怀疑和逃避爱情。为什么会是“探索”啊？隐居起来还怎么探索呢？在家里工作吗?那个时代还没有SOHU族吧……",
		"{name}{year}年{month}月{day}日翻到【X.命运之轮】【逆位】轮回劣势、时机不好、生活困苦、毫无头绪、情况恶化、工作易出错、停止前进、失恋、恋情短暂。真是一个无序的轮回啊。偶尔也会出点小状况，但只要清除BUG就可以了。{name}听见了吗？她要清除你这个BUG啊！！",
		"{name}{year}年{month}月{day}日翻到【XⅠ.正义】【逆位】均衡失衡、偏见、纠纷、诉讼、独断专行、问心有愧、无法两全、表里不一、男女性格不合、情感波折、无视社会道德的恋情。失衡就是不公正...吗……很贴切哦。那么我们每天在这里傻傻的站着是否是一种失衡呢？这个……是一种义务。……...",
		"{name}{year}年{month}月{day}日翻到【XⅡ.倒吊男】【逆位】牺牲无谓的牺牲、骨折、恶运、不够努力、处于劣势、任性、利己主义者、缺乏耐心、受惩罚、逃避爱情、没有结果的恋情。……我们会永远铭记{name}的。真的……被牺牲了呢……w",
		"{name}{year}年{month}月{day}日翻到【XⅢ.死神】【逆位】结束抱有一线希望、起死回生、回心转意、摆脱低迷状态、挽回名誉、身体康复、突然改变计划、逃避现实、斩断情丝、与旧情人相逢。……是逆位啊，好可惜呢。什么可惜啊……",
		"{name}{year}年{month}月{day}日翻到【XⅣ.节制】【逆位】净化消耗、下降、疲劳、损失、不安、不融洽、爱情的配合度不佳 。貌似不但没有净化，反而被污染了。所谓“事与愿违”吧……",
		"{name}{year}年{month}月{day}日翻到【XⅤ.恶魔】【逆位】诱惑逃离拘束、解除困扰、治愈病痛、告别过去、暂停、别离、拒绝诱惑、舍弃私欲、离别时刻、爱恨交加的恋情。{name}……你又要诱惑{name}吗……",
		"{name}{year}年{month}月{day}日翻到【XⅥ.塔】【逆位】破灭事故或麻烦轻松解决、解决问题、小灾难、背黑锅、事故或麻烦留下后遗症。还是不太妙呢。毕竟关键词是破灭啊。",
		"{name}{year}年{month}月{day}日翻到【XⅦ.星星】【逆位】希望挫折、失望、好高骛远、异想天开、仓皇失措、事与愿违、工作不顺心、情况悲观、秘密恋情、缺少爱的生活。希望的彼岸果然是绝望吗。恩……",
		"{name}{year}年{month}月{day}日翻到【XⅧ.月亮】【逆位】不安逃脱骗局、解除物会、状况好转、预知危险、等待、正视爱情的裂缝。月亮吗……我喜欢月亮。哦？很有情调啊。晚上下手比较容易得手。对谁下手啊……",
		"{name}{year}年{month}月{day}日翻到【XⅨ.太阳】【逆位】生命消沉、体力不佳、缺乏连续性、意志消沉、生活不安、人际关系不好、感情波动、离婚。简直就是恶运……逆位嘛，不是人家的错了。",
		"{name}{year}年{month}月{day}日翻到【ⅩⅩ.审判】【逆位】复活一蹶不振、幻灭、隐瞒、坏消息、无法决定、缺少目标、没有进展、消除、依依不舍。完蛋了。好悲观的表情……",
		"{name}{year}年{month}月{day}日翻到【XXⅠ.世界】【逆位】达成未完成、失败、准备不足、盲目接受、一时不顺利、半途而废、精神颓废、饱和状态、不谋而合、态度不够融洽、感情受挫。失败了呢……{name}从头开始吧。真难得呢，在鼓励{name}。什么话嘛，人家一直很支持{name}的。",
    ),
    //「こんにちは」「こんにちわ」「こんちは」「こんちわ」を含む発言を受け取ると「こんにちはこんにちは！」と返す正規表現のサンプルです
    "こん(に)?ち[はわ]"=> array(
        "こんにちはこんにちは！",
    ),
    // 中文版早上好
    "早.*(好|安)"=> array(
    	"早安。",
    	"{id}，早上好！今天帮我刷牙了吗？",
    ),
    // 你好
    "你好"=> array(
    	"你好啊^_^",
    ),
    // 中文版晚安
    "晚.*安"=> array(
    	"嗯，好梦/~",
    	"撸管要有节制哦，知道了吗，{id}？",
    ),
    // follow me
    "follow"=> array(
    	"你在说什么人家还不明白啊（捂脸",
    ),
    // unfollow me
    "(unfollow|remove)"=> array(
    	"{id}你不要这样~",
    ),
    //「会話終了」を含む発言を受け取るとリプライを返さないようにするサンプルです
    "会話終了"=> array(
        "[[END]]",
    ),
);